# IsDataCompleted Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ZoneEquipmentData..::..IsDataCompleted Method
ZoneEquipmentData Class See Also
---
Is the required data completed for this zone equipment?
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public bool IsDataCompleted()
```

Visual Basic
---
```text
Public Function IsDataCompleted As Boolean
```

Visual C++
---
```text
public:
bool IsDataCompleted()
```

# See Also
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace